Ran Plan for dir: `non-prod/stage/eu-west-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/04/10 18:57:36 Setting download directory for module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1 to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/.terragrunt-cache
[terragrunt] 2020/04/10 18:57:36 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1 does not have an associated terraform configuration and will be skipped.
[terragrunt] 2020/04/10 18:57:36 Setting download directory for module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3 to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache
[terragrunt] 2020/04/10 18:57:36 Stack at /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1:
  => Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3 (excluded: false, dependencies: [])
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3 must wait for 0 dependencies to finish
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Running module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3 now
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3/terragrunt.hcl
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Assuming IAM role arn:aws:iam::446381716460:role/982489228146-cross-account-administrator-access
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 WARNING: no double-slash (//) found in source URL /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/_modules/s3. Relative paths in downloaded Terraform code may not work.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Downloading Terraform configurations from file:///home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/_modules/s3 into /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/woaN2h08olxtVCrZw2Vj0jz8lW4/05HV-AazAUUKBfk_u1PATMnoFUk
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Copying files from /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3 into /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/woaN2h08olxtVCrZw2Vj0jz8lW4/05HV-AazAUUKBfk_u1PATMnoFUk
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Setting working directory to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/woaN2h08olxtVCrZw2Vj0jz8lW4/05HV-AazAUUKBfk_u1PATMnoFUk
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:42 Running command: terraform plan -no-color -out /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/default.tfplan
var.role_arn
  Enter a value: 
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_caller_identity.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "446381716460-stage-my-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stage"
          + "Name"        = "my-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/default.tfplan"

[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:48 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3 has finished successfully!
[terragrunt] 2020/04/10 18:57:48 Error with plan: [terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Running command: terraform --version
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:36 Initializing remote state for the s3 backend
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 [terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3]  Remote state S3 bucket 446381716460-test-infrastructure-live does not exist or you don't have permissions to access it. Would you like Terragrunt to create it? (y/n) 
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 The non-interactive flag is set to true, so assuming 'yes' for all prompts
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 Create S3 bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 Creating S3 bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 Waiting for bucket 446381716460-test-infrastructure-live to be created
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 S3 bucket 446381716460-test-infrastructure-live created.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:37 Enabling root access to S3 bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:38 Enabled root access to bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:38 Blocking all public access to S3 bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:38 No tags specified for bucket 446381716460-test-infrastructure-live.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:38 Enabling versioning on S3 bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:38 Enabling bucket-wide SSE on AWS S3 bucket 446381716460-test-infrastructure-live
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:39 Granting WRITE and READ_ACP permissions to S3 Log Delivery (http://acs.amazonaws.com/groups/s3/LogDelivery) for bucket 446381716460-test-infrastructure-live. This is required for access logging.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:39 Waiting for ACL bucket 446381716460-test-infrastructure-live to have the updated ACL for access logging.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:39 Bucket 446381716460-test-infrastructure-live now has the proper ACL permissions for access logging!
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:39 Enabling bucket-wide Access Logging on AWS S3 bucket "446381716460-test-infrastructure-live" - using as TargetBucket "446381716460-test-infrastructure-live"
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/48/default/non-prod/stage/eu-west-1/s3] 2020/04/10 18:57:39 Running command: terraform init -backend-config=key=stage/eu-west-1/s3/terraform.tfstate -backend-config=region=eu-west-3 -backend-config=bucket=446381716460-test-infrastructure-live -backend-config=dynamodb_table=terraform-locks -backend-config=encrypt=true

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.57.0...

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d non-prod/stage/eu-west-1`
* :put_litter_in_its_place: To **delete** this plan click [here](https://stage-atlantis.adventiel.io/lock?id=gwendallg%252Fatlantis-test%252Fnon-prod%252Fstage%252Feu-west-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d non-prod/stage/eu-west-1`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
